/*
 * 쉬프트연산자 (비트이동연산자)
 *  <<(왼쪽이동)    ,   >>(오른쪽이동)
 *   
 *   10<<2
 *   1010   1010 뒤에 공배 2개를 채우고
 * 101000      -> 40
 * 
 *   x << y ==> x * 2^y
 *              10 * 4 ==> 40
 *    
 * 
 *   
 *   10>>2    
 *   1010    1010뒤를 2개 버려라.
 *     10,10  -> , 이하 사라짐
 *   
 *   x >> y   ==> x / 2^y
 *                10 / 4  ==>
 *                
 *                
 *     14 << 3 112 (14*8)
 *     
 *        1110
 *     1110000  --> 112
 *     
 *     
 *     14 >> 3-->1
 *     1110
 *        1(110) ()--> 사라짐
 *   
 *   
 *   
 */
public class 이항연산자_쉬프트연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
      int a=14<<3;
      int b=14>>3;
      
      System.out.println("a="+a);
      System.out.println("b="+b);
	}

}
